sepinedas/halloween-mask/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Run flat out - the audio task needs the headroom
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# 1 ms tick so the audio task wakes promptly
CONFIG_FREERTOS_HZ=1000

# Optimise for speed, keep full printf (we print floats)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_NEWLIB_NANO_FORMAT=n

# No radios: saves ~80 mA of battery and frees core 0
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n

# Console on UART0 at 115200
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
